SchumyHao/heat_meter_rtt/drivers/rt_stm32f0xx_spi.c
/*
 * File      : rt_stm32f0xx_spi.c
 * COPYRIGHT (C) 2014-2015, Schumy Hao
 *
 * Change Logs:
 * Date           Author       Notes
 * 2014-12-19     Schumy       the first version
 */

#include <rtdevice.h>
#include "stm32f0xx.h"
#include "rt_stm32f0xx_spi.h"

#define SPI_DUMP 0xff
#define SPI_XFER_ONEC_MAX_LEN (32)
#define SPI_RX_DMA_FRAME_NUM  (4)

/* SPI1 */
#define SPI1_GPIO_MISO_PIN       GPIO_Pin_6
#define SPI1_GPIO_MISO_SOURCE    GPIO_PinSource6
#define SPI1_GPIO_MOSI_PIN       GPIO_Pin_7
#define SPI1_GPIO_MOSI_SOURCE    GPIO_PinSource7
#define SPI1_GPIO_SCLK_PIN       GPIO_Pin_5
#define SPI1_GPIO_SCLK_SOURCE    GPIO_PinSource5
#define SPI1_GPIO_NSS_PIN        GPIO_Pin_4
#define SPI1_GPIO_NSS_SOURCE     GPIO_PinSource4
#define SPI1_GPIO_PIN_GROUP      GPIOA
#define SPI1_GPIO_PIN_RCC        RCC_AHBPeriph_GPIOA
#define SPI1_GPIO_PIN_AF         GPIO_AF_0
#define SPI1_RCC                 RCC_APB2Periph_SPI1
#define SPI1_DMA_RCC             RCC_AHBPeriph_DMA1
#ifdef RT_USING_SPI1_TX_DMA
#define SPI1_DMA_TX              DMA1_Channel3
#else
#define SPI1_DMA_TX              RT_NULL
#endif /* RT_USING_SPI1_TX_DMA */
#ifdef RT_USING_SPI1_RX_DMA
#define SPI1_DMA_RX              DMA1_Channel2
static uint8_t stm32_spi1_rx_dma_buf[SPI_XFER_ONEC_MAX_LEN* SPI_RX_DMA_FRAME_NUM];
#else
#define SPI1_DMA_RX              RT_NULL
#endif /* RT_USING_SPI1_RX_DMA */

/* SPI2 */
#define SPI2_GPIO_MISO_PIN       GPIO_Pin_14
#define SPI2_GPIO_MISO_SOURCE    GPIO_PinSource14
#define SPI2_GPIO_MOSI_PIN       GPIO_Pin_15
#define SPI2_GPIO_MOSI_SOURCE    GPIO_PinSource15
#define SPI2_GPIO_SCLK_PIN       GPIO_Pin_13
#define SPI2_GPIO_SCLK_SOURCE    GPIO_PinSource13
#define SPI2_GPIO_NSS_PIN        GPIO_Pin_12
#define SPI2_GPIO_NSS_SOURCE     GPIO_PinSource12
#define SPI2_GPIO_PIN_GROUP      GPIOB
#define SPI2_GPIO_PIN_RCC        RCC_AHBPeriph_GPIOB
#define SPI2_GPIO_PIN_AF         GPIO_AF_0
#define SPI2_RCC                 RCC_APB1Periph_SPI2
#define SPI2_DMA_RCC             RCC_AHBPeriph_DMA1
#ifdef RT_USING_SPI2_TX_DMA
#define SPI2_DMA_TX              DMA1_Channel5
#else
#define SPI2_DMA_TX              RT_NULL
#endif /* RT_USING_SPI2_TX_DMA */
#ifdef RT_USING_SPI2_RX_DMA
#define SPI2_DMA_RX              DMA1_Channel4
static uint8_t stm32_spi2_rx_dma_buf[SPI_XFER_ONEC_MAX_LEN* SPI_RX_DMA_FRAME_NUM];
#else
#define SPI2_DMA_RX              RT_NULL
#endif /* RT_USING_SPI2_RX_DMA */

struct stm32_spi_cs {
    GPIO_TypeDef* GPIOx;
    uint16_t GPIO_Pin;
};

struct stm32_spi_bus {
    /* must be first */
    struct rt_spi_bus parent;

    SPI_TypeDef* spix;
    SPI_InitTypeDef init;
    struct stm32_spi_cs* cs;
    void* tx_buf;
    //uint32_t tx_xfer_size;
    //uint32_t tx_buf_count;
    void* rx_buf;
    uint32_t xfer_size;
    //uint32_t rx_xfer_size;
    //uint32_t rx_buf_count;
    void (*TxISR)(struct stm32_spi_bus* bus);
    void (*RxISR)(struct stm32_spi_bus* bus);
    DMA_Channel_TypeDef* tx_dma;
    DMA_Channel_TypeDef* rx_dma;
    void (*TxDMAISR)(struct stm32_spi_bus* bus);
    void (*RxDMAISR)(struct stm32_spi_bus* bus);
};

rt_inline uint16_t stm32_spi_bus_get_DataSize(rt_uint8_t data_width)
{
    uint16_t SPI_DataSize = 0;

    RT_ASSERT((data_width == 8) ||
              (data_width == 16));

    if(data_width <= 8) {
        SPI_DataSize = SPI_DataSize_8b;
    }
    else {
        SPI_DataSize = SPI_DataSize_16b;
    }

    return SPI_DataSize;
}

rt_inline uint16_t stm32_spi_bus_get_BaudRatePrescaler(rt_uint32_t max_hz)
{
    uint16_t SPI_BaudRatePrescaler = 0;

    RT_ASSERT((max_hz <= SystemCoreClock/2) ||
              (max_hz >= SystemCoreClock/256))

    /* STM32F0xx SPI MAX fpclk/2 = 24Mhz */
    if(max_hz == SystemCoreClock/2) {
        SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
    }
    else if(max_hz >= SystemCoreClock/4) {
        SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_4;
    }
    else if(max_hz >= SystemCoreClock/8) {
        SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_8;
    }
    else if(max_hz >= SystemCoreClock/16) {
        SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_16;
    }
    else if(max_hz >= SystemCoreClock/32) {
        SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_32;
    }
    else if(max_hz >= SystemCoreClock/64) {
        SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_64;
    }
    else if(max_hz >= SystemCoreClock/128) {
        SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_128;
    }
    else {
        SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256;
    }

    return SPI_BaudRatePrescaler;
}

rt_inline uint16_t stm32_spi_bus_get_CPOL(rt_uint8_t mode)
{
    uint16_t SPI_CPOL = 0;

    if(mode & RT_SPI_CPOL) {
        SPI_CPOL = SPI_CPOL_High;
    }
    else {
        SPI_CPOL = SPI_CPOL_Low;
    }

    return SPI_CPOL;
}

rt_inline uint16_t stm32_spi_bus_get_CPHA(rt_uint8_t mode)
{
    uint16_t SPI_CPHA = 0;

    if(mode & RT_SPI_CPHA) {
        SPI_CPHA = SPI_CPHA_2Edge;
    }
    else {
        SPI_CPHA = SPI_CPHA_1Edge;
    }

    return SPI_CPHA;
}

rt_inline uint16_t stm32_spi_bus_get_FirstBit(rt_uint8_t mode)
{
    uint16_t SPI_FirstBit = 0;

    if(mode & RT_SPI_MSB) {
        SPI_FirstBit = SPI_FirstBit_MSB;
    }
    else {
        SPI_FirstBit = SPI_FirstBit_LSB;
    }

    return SPI_FirstBit;
}

rt_inline uint16_t stm32_spi_bus_get_Mode(rt_uint8_t mode)
{
    uint16_t SPI_Mode = 0;

    if(mode & RT_SPI_SLAVE) {
        SPI_Mode = SPI_Mode_Slave;
    }
    else {
        SPI_Mode = SPI_Mode_Master;
    }

    return SPI_Mode;
}

rt_inline void stm32_spi_bus_get_InitTypeDef_from_configuration(SPI_InitTypeDef* SPI_Init, struct rt_spi_configuration* cfg)
{
    SPI_Init->SPI_DataSize = stm32_spi_bus_get_DataSize(cfg->data_width);
    SPI_Init->SPI_BaudRatePrescaler = stm32_spi_bus_get_BaudRatePrescaler(cfg->max_hz);
    SPI_Init->SPI_CPOL = stm32_spi_bus_get_CPOL(cfg->mode);
    SPI_Init->SPI_CPHA = stm32_spi_bus_get_CPHA(cfg->mode);
    SPI_Init->SPI_FirstBit = stm32_spi_bus_get_FirstBit(cfg->mode);
    SPI_Init->SPI_Mode = stm32_spi_bus_get_Mode(cfg->mode);
}

rt_inline rt_bool_t stm32_spi_bus_is_master(struct stm32_spi_bus* bus)
{
    return (SPI_Mode_Master==bus->init->SPI_DataSize)? RT_TRUE: RT_FALSE;
}

rt_inline rt_bool_t stm32_spi_bus_is_8bits(struct stm32_spi_bus* bus)
{
    return (SPI_DataSize_8b==bus->init->SPI_Mode)? RT_TRUE: RT_FALSE;
}

