SchumyHao/heat_meter_rtt/drivers/rt_stm32f0xx_spi.c
rt_inline rt_bool_t stm32_spi_bus_is_tx_dma(struct stm32_spi_bus* bus)
{
    return (RT_NULL==bus->tx_dma)? RT_FALSE: RT_TRUE;
}

rt_inline rt_bool_t stm32_spi_bus_is_rx_dma(struct stm32_spi_bus* bus)
{
    return (RT_NULL==bus->rx_dma)? RT_FALSE: RT_TRUE;
}

static void stm32_spi_bus_cs_pin_init(struct stm32_spi_bus* bus)
{
    GPIO_InitTypeDef SPI_GPIO;
    GPIO_StructInit(&SPI_GPIO);
    if(bus->spix == SPI1) {
        SPI_GPIO.GPIO_Pin = SPI1_GPIO_NSS_PIN;
        SPI_GPIO.GPIO_Mode = GPIO_Mode_AF;
        SPI_GPIO.GPIO_PuPd = GPIO_PuPd_NOPULL;
        SPI_GPIO.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_Init(SPI1_GPIO_PIN_GROUP, &SPI_GPIO);
        GPIO_PinAFConfig(SPI1_GPIO_PIN_GROUP, SPI1_GPIO_NSS_SOURCE, SPI1_GPIO_PIN_AF);
    }
    else if(bus->spix == SPI2) {
        SPI_GPIO.GPIO_Pin = SPI2_GPIO_NSS_PIN;
        SPI_GPIO.GPIO_Mode = GPIO_Mode_AF;
        SPI_GPIO.GPIO_PuPd = GPIO_PuPd_NOPULL;
        SPI_GPIO.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_Init(SPI2_GPIO_PIN_GROUP, &SPI_GPIO);
        GPIO_PinAFConfig(SPI2_GPIO_PIN_GROUP, SPI2_GPIO_NSS_SOURCE, SPI2_GPIO_PIN_AF);
    }
}

static rt_err_t stm32_spi_bus_configure(struct rt_spi_device* dev, struct rt_spi_configuration* cfg)
{
    struct stm32_spi_bus* spi_bus = (struct stm32_spi_bus*)dev->bus;
    SPI_TypeDef* SPIx = spi_bus->spix;

    RT_ASSERT(cfg != RT_NULL);

    SPI_StructInit(&spi_bus->init);
    stm32_spi_bus_get_InitTypeDef_from_configuration(&spi_bus->init, cfg);
	SPI_Init->SPI_Direction = SPI_Direction_2Lines_FullDuplex;
	SPI_Init->SPI_NSS  = SPI_NSS_Soft;
    if(dev->parent.user_data != RT_NULL) {
        struct stm32_spi_bus_cs* cs = (struct stm32_spi_bus_cs*)dev->parent.user_data;
        cs->init(cs);
    }
    else {
        stm32_spi_bus_cs_pin_init(spi_bus);
    }
    SPI_I2S_DeInit(SPIx);
    SPI_Init(SPIx, &spi_bus->init);
	SPI_CalculateCRC(SPIx, DISABLE);

    return RT_EOK;
}

rt_inline void stm32_spi_bus_take_cs(struct stm32_spi_bus* bus)
{
	if(bus->parent->owner->parent->user_data != RT_NULL){
		struct stm32_spi_bus_cs* cs = (struct stm32_spi_bus_cs*)bus->parent->owner->parent->user_data;
		cs->take(cs);
	}
	else{
    	SPI_NSSInternalSoftwareConfig(bus->spix, SPI_NSSInternalSoft_Reset);
	}
}

rt_inline void stm32_spi_bus_release_cs(struct stm32_spi_bus* bus)
{
    if(bus->parent->owner->parent->user_data != RT_NULL){
		struct stm32_spi_bus_cs* cs = (struct stm32_spi_bus_cs*)bus->parent->owner->parent->user_data;
		cs->release(cs);
	}
	else{
    	SPI_NSSInternalSoftwareConfig(bus->spix, SPI_NSSInternalSoft_Set);
	}
}

rt_inline rt_size_t stm32_spi_set_tx_buf(struct stm32_spi_bus* bus, const rt_uint8_t* tx_buf, rt_size_t len)
{
    rt_size_t n = 0;
    if(stm32_spi_bus_is_tx_dma(bus)) {
        bus->tx_buf = tx_buf;
        return (len>SPI_XFER_ONEC_MAX_LEN)? SPI_XFER_ONEC_MAX_LEN: len;
    }
    else {
        n = rt_ringbuffer_put(bus->tx_buf, tx_buf, len);
        return n;
    }
}

rt_inline rt_size_t stm32_spi_set_rx_buf(struct stm32_spi_bus* bus, rt_uint8_t* rx_buf, rt_size_t len)
{
    rt_size_t n = 0;
    if(stm32_spi_bus_is_rx_dma(bus)) {
        bus->rx_buf = rx_buf;
        return (len>SPI_XFER_ONEC_MAX_LEN)? SPI_XFER_ONEC_MAX_LEN: len;
    }
    else {
        n = rt_ringbuffer_get(bus->rx_buf, rx_buf, len);
        return n;
    }
}

rt_inline rt_err_t _stm32_spi_bus_transmit_dma_receive_dma(struct stm32_spi_bus* bus)
{
    SPI_TypeDef* SPIx = bus->spix;
	DMA_InitTypeDef SPI_DMA;
    rt_size_t dma_count = bus->xfer_size;

    if(stm32_spi_bus_is_8bits(bus)) {
        SPI_RxFIFOThresholdConfig(SPIx, SPI_RxFIFOThreshold_QF);
		DMA_StructInit(&SPI_DMA);
    	SPI_DMA.DMA_DIR = DMA_DIR_PeripheralDST;
	    SPI_DMA.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	    SPI_DMA.DMA_MemoryInc = DMA_MemoryInc_Enable;
	    SPI_DMA.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	    SPI_DMA.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	    SPI_DMA.DMA_Mode = DMA_Mode_Normal;
	    SPI_DMA.DMA_Priority = DMA_Priority_Low;
	    SPI_DMA.DMA_BufferSize = dma_count;
	    SPI_DMA.DMA_M2M = DMA_M2M_Disable;
	    SPI_DMA.DMA_MemoryBaseAddr = bus->tx_buf;
	    SPI_DMA.DMA_PeripheralBaseAddr = SPIx->DR;
   		DMA_Init(bus->tx_dma, &SPI_DMA);
    	SPI_DMA.DMA_DIR = DMA_DIR_PeripheralSRC;
	    SPI_DMA.DMA_MemoryBaseAddr = bus->rx_buf;
   		DMA_Init(bus->tx_dma, &SPI_DMA);
    }
    else {
        SPI_RxFIFOThresholdConfig(SPIx, SPI_RxFIFOThreshold_HF);
		DMA_StructInit(&SPI_DMA);
    	SPI_DMA.DMA_DIR = DMA_DIR_PeripheralDST;
	    SPI_DMA.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	    SPI_DMA.DMA_MemoryInc = DMA_MemoryInc_Enable;
	    SPI_DMA.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
	    SPI_DMA.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
	    SPI_DMA.DMA_Mode = DMA_Mode_Normal;
	    SPI_DMA.DMA_Priority = DMA_Priority_Low;
	    SPI_DMA.DMA_BufferSize = dma_count>>1;
	    SPI_DMA.DMA_M2M = DMA_M2M_Disable;
	    SPI_DMA.DMA_MemoryBaseAddr = bus->tx_buf;
	    SPI_DMA.DMA_PeripheralBaseAddr = SPIx->DR;
   		DMA_Init(bus->tx_dma, &SPI_DMA);
    	SPI_DMA.DMA_DIR = DMA_DIR_PeripheralSRC;
	    SPI_DMA.DMA_MemoryBaseAddr = bus->rx_buf;
   		DMA_Init(bus->tx_dma, &SPI_DMA);
    }
	SPI_I2S_DMACmd(SPIx, SPI_I2S_DMAReq_Tx | SPI_I2S_DMAReq_Rx, ENABLE);
	DMA_ITConfig(bus->rx_dma, DMA_IT_TC, ENABLE);
    DMA_ITConfig(bus->tx_dma, DMA_IT_TC, ENABLE);
	DMA_Cmd(bus->rx_dma, ENABLE);
	DMA_Cmd(bus->tx_dma, ENABLE);

	return RT_EOK;
}

rt_inline rt_err_t _stm32_spi_bus_transmit_it_receive_dma(struct stm32_spi_bus* bus)
{
    SPI_TypeDef* SPIx = bus->spix;
	DMA_InitTypeDef SPI_DMA;
    rt_size_t dma_count = bus->xfer_size;

    if(stm32_spi_bus_is_8bits(bus)) {
        SPI_RxFIFOThresholdConfig(SPIx, SPI_RxFIFOThreshold_QF);
		DMA_StructInit(&SPI_DMA);
    	SPI_DMA.DMA_DIR = DMA_DIR_PeripheralSRC;
	    SPI_DMA.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	    SPI_DMA.DMA_MemoryInc = DMA_MemoryInc_Enable;
	    SPI_DMA.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	    SPI_DMA.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	    SPI_DMA.DMA_Mode = DMA_Mode_Normal;
	    SPI_DMA.DMA_Priority = DMA_Priority_Low;
	    SPI_DMA.DMA_BufferSize = dma_count;
	    SPI_DMA.DMA_M2M = DMA_M2M_Disable;
	    SPI_DMA.DMA_MemoryBaseAddr = bus->rx_buf;
	    SPI_DMA.DMA_PeripheralBaseAddr = SPIx->DR;
   		DMA_Init(bus->tx_dma, &SPI_DMA);
    }
    else {
        SPI_RxFIFOThresholdConfig(SPIx, SPI_RxFIFOThreshold_HF);
		DMA_StructInit(&SPI_DMA);
    	SPI_DMA.DMA_DIR = DMA_DIR_PeripheralSRC;
	    SPI_DMA.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	    SPI_DMA.DMA_MemoryInc = DMA_MemoryInc_Enable;
	    SPI_DMA.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
	    SPI_DMA.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
	    SPI_DMA.DMA_Mode = DMA_Mode_Normal;
	    SPI_DMA.DMA_Priority = DMA_Priority_Low;
	    SPI_DMA.DMA_BufferSize = dma_count>>1;
	    SPI_DMA.DMA_M2M = DMA_M2M_Disable;
	    SPI_DMA.DMA_MemoryBaseAddr = bus->rx_buf;
	    SPI_DMA.DMA_PeripheralBaseAddr = SPIx->DR;
   		DMA_Init(bus->tx_dma, &SPI_DMA);
    }
	SPI_I2S_DMACmd(SPIx, SPI_I2S_DMAReq_Rx, ENABLE);
	DMA_ITConfig(bus->rx_dma, DMA_IT_TC, ENABLE);
	DMA_Cmd(bus->rx_dma, ENABLE);
	SPI_I2S_ITConfig(SPIx, SPI_I2S_IT_TXE, ENABLE);

