SchumyHao/heat_meter_rtt/drivers/rt_stm32f0xx_spi.c
	return RT_EOK;
}

rt_inline rt_err_t _stm32_spi_bus_transmit_dma_receive_it(struct stm32_spi_bus* bus)
{
    SPI_TypeDef* SPIx = bus->spix;
	DMA_InitTypeDef SPI_DMA;
    rt_size_t dma_count = bus->xfer_size;

    if(stm32_spi_bus_is_8bits(bus)) {
        SPI_RxFIFOThresholdConfig(SPIx, SPI_RxFIFOThreshold_QF);
		DMA_StructInit(&SPI_DMA);
    	SPI_DMA.DMA_DIR = DMA_DIR_PeripheralDST;
	    SPI_DMA.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	    SPI_DMA.DMA_MemoryInc = DMA_MemoryInc_Enable;
	    SPI_DMA.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	    SPI_DMA.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	    SPI_DMA.DMA_Mode = DMA_Mode_Normal;
	    SPI_DMA.DMA_Priority = DMA_Priority_Low;
	    SPI_DMA.DMA_BufferSize = dma_count;
	    SPI_DMA.DMA_M2M = DMA_M2M_Disable;
	    SPI_DMA.DMA_MemoryBaseAddr = bus->tx_buf;
	    SPI_DMA.DMA_PeripheralBaseAddr = SPIx->DR;
   		DMA_Init(bus->tx_dma, &SPI_DMA);
    }
    else {
        SPI_RxFIFOThresholdConfig(SPIx, SPI_RxFIFOThreshold_HF);
		DMA_StructInit(&SPI_DMA);
    	SPI_DMA.DMA_DIR = DMA_DIR_PeripheralDST;
	    SPI_DMA.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	    SPI_DMA.DMA_MemoryInc = DMA_MemoryInc_Enable;
	    SPI_DMA.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
	    SPI_DMA.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
	    SPI_DMA.DMA_Mode = DMA_Mode_Normal;
	    SPI_DMA.DMA_Priority = DMA_Priority_Low;
	    SPI_DMA.DMA_BufferSize = dma_count>>1;
	    SPI_DMA.DMA_M2M = DMA_M2M_Disable;
	    SPI_DMA.DMA_MemoryBaseAddr = bus->tx_buf;
	    SPI_DMA.DMA_PeripheralBaseAddr = SPIx->DR;
   		DMA_Init(bus->tx_dma, &SPI_DMA);
    }
	SPI_I2S_DMACmd(SPIx, SPI_I2S_DMAReq_Tx, ENABLE);
	SPI_I2S_ITConfig(SPIx, SPI_I2S_IT_RXNE, ENABLE);
    DMA_ITConfig(bus->tx_dma, DMA_IT_TC, ENABLE);
	DMA_Cmd(bus->tx_dma, ENABLE);

	return RT_EOK;
}

rt_inline rt_err_t _stm32_spi_bus_transmit_it_receive_it(struct stm32_spi_bus* bus)
{
 	SPI_TypeDef* SPIx = bus->spix;

    if(stm32_spi_bus_is_8bits(bus)) {
        SPI_RxFIFOThresholdConfig(SPIx, SPI_RxFIFOThreshold_QF);
    }
    else {
        SPI_RxFIFOThresholdConfig(SPIx, SPI_RxFIFOThreshold_HF);
    }
	SPI_I2S_ITConfig(SPIx, SPI_I2S_IT_TXE | SPI_I2S_IT_RXNE, ENABLE);

	return RT_EOK;
}

rt_inline rt_err_t __stm32_spi_bus_transmit_receive(struct stm32_spi_bus* bus)
{
    SPI_TypeDef* SPIx = bus->spix;

    /* check SPI bus is busy or not */
    if(RESET != SPI_I2S_GetFlagStatus(SPIx, SPI_I2S_FLAG_BSY)) {
        return -RT_EBUSY;
    }

    /* send data though dma/interrupt */
    if(stm32_spi_bus_is_tx_dma(bus) && stm32_spi_bus_is_rx_dma(bus)) {
        _stm32_spi_bus_transmit_dma_receive_dma(bus);
    }
    else if(!stm32_spi_bus_is_tx_dma(bus) && stm32_spi_bus_is_rx_dma(bus)) {
        _stm32_spi_bus_transmit_it_receive_dma(bus);
    }
    else if(stm32_spi_bus_is_tx_dma(bus) && !stm32_spi_bus_is_rx_dma(bus)) {
        _stm32_spi_bus_transmit_dma_receive_it(bus);
    }
    else {
        _stm32_spi_bus_transmit_it_receive_it(bus);
    }

    return RT_EOK;
}

static rt_err_t _stm32_spi_bus_transmit_receive(struct stm32_spi_bus* bus, const rt_uint8_t* tx_buf, rt_uint8_t* rx_buf)
{
    rt_size_t len = 0;
    rt_size_t xfern = 0;
    rt_uint8_t dump_tx_buf[SPI_XFER_ONEC_MAX_LEN];
    rt_uint8_t* tx_ptr = tx_buf;
    rt_uint8_t* rx_ptr = rx_buf;

    len = bus->xfer_size;

    while(len>0) {
        if(tx_buf==RT_NULL) {
			rt_memset(dump_tx_buf ,SPI_DUMP ,sizeof(dump_tx_buf));
            xfern = stm32_spi_set_tx_buf(bus, dump_tx_buf, len);
        }
        else {
            xfern = stm32_spi_set_tx_buf(bus, tx_ptr, len);
            tx_ptr += xfern;
        }
        bus->rx_buf = rx_ptr;
        __stm32_spi_bus_transmit_receive(bus);
        if(rx_buf != RT_NULL) {
            stm32_spi_set_rx_buf(bus, rx_ptr, xfern);
            rx_ptr += xfern;
        }
        len -= xfern;
    }

    return RT_EOK;
}

rt_inline rt_err_t stm32_spi_bus_transmit_receive(struct stm32_spi_bus* bus, const rt_uint8_t* tx_buf, rt_uint8_t* rx_buf)
{
	if((bus->parent.parent.open_flag & RT_DEVICE_OFLAG_RDWR)==RT_DEVICE_OFLAG_RDWR){
   		return _stm32_spi_bus_transmit_receive(bus, tx_buf, rx_buf);
	}
	return -RT_EIO;
}

rt_inline rt_err_t stm32_spi_bus_transmit(struct stm32_spi_bus* bus, const rt_uint8_t* tx_buf)
{
	if(bus->parent.parent.open_flag & RT_DEVICE_OFLAG_WRONLY){
   		return _stm32_spi_bus_transmit_receive(bus, tx_buf, RT_NULL);
	}
	return -RT_EIO;
}

rt_inline rt_err_t stm32_spi_bus_receive(struct stm32_spi_bus* bus, rt_uint8_t* rx_buf)
{
	if(bus->parent.parent.open_flag & RT_DEVICE_OFLAG_RDONLY){
    	return _stm32_spi_bus_transmit_receive(bus, RT_NULL, rx_buf);
	}
	return -RT_EIO;
}

static rt_uint32_t stm32_spi_bus_xfer(struct rt_spi_device* dev, struct rt_spi_message* msg)
{
	rt_uint32_t ret = 0;
    struct stm32_spi_bus* spi_bus = (struct stm32_spi_bus*)dev->bus;
    SPI_TypeDef* SPIx = spi_bus->spix;

	/* enable spi bus */
	SPI_Cmd(SPIx, ENABLE);

    if(stm32_spi_bus_is_master(spi_bus) && msg->cs_take) {
        take_cs(spi_bus);
    }

    spi_bus->xfer_size = (stm32_spi_bus_is_8bits(spi_bus))? msg->length: msg->length<<1;

    if((RT_NULL!=msg->send_buf)&&(RT_NULL!=msg->recv_buf)) {
        if(RT_EOK != stm32_spi_bus_transmit_receive(spi_bus, 
			(const rt_uint8_t*)msg->send_buf, 
			(rt_uint8_t*)msg->recv_buf)){
			ret = 0;
			goto out;
		}
    }
    else {
        if(RT_NULL!=msg->send_buf) {
            if(RT_EOK != stm32_spi_bus_transmit(spi_bus, 
				(const rt_uint8_t*)msg->send_buf)){
				ret = 0;
				goto out;
			}
        }
        if(RT_NULL!=msg->recv_buf) {
            if(RT_EOK != stm32_spi_bus_receive(spi_bus, 
				(rt_uint8_t*)msg->recv_buf)){
				ret = 0;
				goto out;
			}
        }
    }
	ret = msg->length;

out:
    if(stm32_spi_bus_is_master(spi_bus) && msg->cs_release) {
        release_cs(spi_bus);
    }
	/* disable spi bus */
	SPI_Cmd(SPIx, DISABLE);

    return ret;
};

static struct rt_spi_ops stm32_spi_ops = {
    stm32_spi_bus_configure,
    stm32_spi_bus_xfer
};

#ifdef USING_SPI1
static struct stm32_spi_bus stm32_spi_bus_1;
void SPI1_IRQHandler(void)
{
    struct stm32_spi_bus* bus = &stm32_spi_bus_1;

    /* enter interrupt */
    rt_interrupt_enter();
	
	if(SPI_I2S_GetITStatus(bus->spix, SPI_I2S_IT_TXE) != RESET){
		bus->TxISR(bus);
	}
	if(SPI_I2S_GetITStatus(bus->spix, SPI_I2S_IT_RXNE) != RESET){
		bus->RxISR(bus);
	}
    
    /* leave interrupt */
    rt_interrupt_leave();
}
void DMA1_Channel2_3_IRQHandler(void){
    struct stm32_spi_bus* bus = &stm32_spi_bus_1;

    /* enter interrupt */
    rt_interrupt_enter();

	if(DMA_GetITStatus(DMA1_IT_TC2) != RESET){
		bus->RxDMAISR(bus);
		DMA_ClearITPendingBit(DMA1_IT_TC2);
	}
	if(DMA_GetITStatus(DMA1_IT_TC3) != RESET){
		bus->TxDMAISR(bus);
		DMA_ClearITPendingBit(DMA1_IT_TC3);
	}
    
    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* #ifdef USING_SPI1 */

