SchumyHao/heat_meter_rtt/drivers/rt_stm32f0xx_spi.c
#ifdef USING_SPI2
static struct stm32_spi_bus stm32_spi_bus_2;
void SPI2_IRQHandler(void)
{
    struct stm32_spi_bus* bus = &stm32_spi_bus_2;

    /* enter interrupt */
    rt_interrupt_enter();
	
	if(SPI_I2S_GetITStatus(bus->spix, SPI_I2S_IT_TXE) != RESET){
		bus->TxISR(bus);
	}
	if(SPI_I2S_GetITStatus(bus->spix, SPI_I2S_IT_RXNE) != RESET){
		bus->RxISR(bus);
	}
    
    /* leave interrupt */
    rt_interrupt_leave();
}
void DMA1_Channel4_5_IRQHandler(void){
    struct stm32_spi_bus* bus = &stm32_spi_bus_2;

    /* enter interrupt */
    rt_interrupt_enter();

	if(DMA_GetITStatus(DMA1_IT_TC4) != RESET){
		bus->RxDMAISR(bus);
		DMA_ClearITPendingBit(DMA1_IT_TC4);
	}
	if(DMA_GetITStatus(DMA1_IT_TC5) != RESET){
		bus->TxDMAISR(bus);
		DMA_ClearITPendingBit(DMA1_IT_TC5);
	}
    
    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* #ifdef USING_SPI2 */

static rt_err_t stm32_spi_bus_init(rt_device_t dev)
{
    rt_err_t ret = RT_EOK;

    if(dev->type == RT_Device_Class_SPIBUS) {
        struct stm32_spi_bus* spi_bus = (struct stm32_spi_bus*)dev;
#ifdef RT_USING_SPI1
        if(spi_bus->spix == SPI1) {
            ret = stm32_spi_bus_device_init(spi_bus, "spi1");
            if(RT_EOK != ret) {
                return ret;
            }
        }
#endif /* RT_USING_SPI1 */

#ifdef RT_USING_SPI2
        if(spi_bus->spix == SPI2) {
            ret = stm32_spi_bus_device_init(spi_bus, "spi2");
            if(RT_EOK != ret) {
                return ret;
            }
        }
#endif /* RT_USING_SPI2 */
    }
    else {
        return -RT_ERROR;
    }

    return RT_EOK;
}

static rt_err_t stm32_spi_bus_open(rt_device_t dev, rt_uint16_t oflag)
{
    if(dev->type == RT_Device_Class_SPIBUS) {
        /* not open as read or write, return error */
        if(!(oflag & RT_DEVICE_OFLAG_RDWR)) {
            return -RT_ERROR;
        }
        return RT_EOK;
    }
    else {
        return -RT_ERROR;
    }
}

static rt_err_t stm32_spi_bus_close(rt_device_t dev)
{
    if(dev->type == RT_Device_Class_SPIBUS) {
        struct stm32_spi_bus* bus = (struct stm32_spi_bus*)dev;
        if(RT_NULL != bus->rx_dma) { /* use dma */
            DMA_ITConfig(bus->rx_dma, DMA_IT_TC, DISABLE);
            DMA_Cmd(bus->rx_dma, DISABLE);
        }
        else { /* use interrupt */
            SPI_I2S_ITConfig(bus->spix, SPI_I2S_IT_RXNE, DISABLE);
        }
        if(RT_NULL != bus->tx_dma) { /* use dma */
            DMA_ITConfig(bus->tx_dma, DMA_IT_TC, DISABLE);
            DMA_Cmd(bus->tx_dma, DISABLE);
        }
        else { /* use interrupt */
            SPI_I2S_ITConfig(bus->spix, SPI_I2S_IT_TXE, DISABLE);
        }
        SPI_Cmd(bus->spix, DISABLE);
    }
    else {
        return -RT_ERROR;
    }

    return RT_EOK;
}

static rt_err_t stm32_spi_bus_register(struct rt_spi_bus* spi_bus, const char* spi_bus_name)
{
    rt_err_t ret = RT_EOK;

    ret = rt_spi_bus_register(spi_bus, spi_bus_name, &stm32_spi_ops)
    if(RT_EOK != ret) {
        return ret;
    }
    ret = rt_mutex_take(&(spi_bus->lock), RT_WAITING_FOREVER);
    if (ret == RT_EOK) {
        spi_bus->parent.init = stm32_spi_bus_init;
        spi_bus->parent.open = stm32_spi_bus_open;
        spi_bus->parent.close = stm32_spi_bus_close;
        rt_mutex_release(&(spi_bus->lock));
    }

    return RT_EOK;
}

static void STM32_spi1_bus_rx_dma_isr(struct stm32_spi_bus* bus){

}

static void STM32_spi1_bus_tx_dma_isr(struct stm32_spi_bus* bus){

}

static void STM32_spi1_bus_rx_isr(struct stm32_spi_bus* bus){

}

static void STM32_spi1_bus_tx_isr(struct stm32_spi_bus* bus){

}

static void STM32_spi2_bus_rx_dma_isr(struct stm32_spi_bus* bus){

}

static void STM32_spi2_bus_tx_dma_isr(struct stm32_spi_bus* bus){

}

static void STM32_spi2_bus_rx_isr(struct stm32_spi_bus* bus){

}

static void STM32_spi2_bus_tx_isr(struct stm32_spi_bus* bus){

}

static rt_err_t stm32_spi_bus_device_init(struct stm32_spi_bus* spi_bus, const char* spi_bus_name)
{
    rt_err_t ret = RT_EOK;
    GPIO_InitTypeDef SPI_GPIO;

    ret = stm32_spi_bus_register(&(spi_bus->parent), spi_bus_name);
    if(RT_EOK != ret) {
        return ret;
    }

    if(spi_bus->spix == SPI1) {
        /* SPI1 RCC */
        RCC_APB2PeriphClockCmd(SPI1_RCC, ENABLE);

        /* SPI1 GPIO */
        RCC_AHBPeriphClockCmd(SPI1_GPIO_PIN_RCC, ENABLE);
        GPIO_StructInit(&SPI_GPIO);
        SPI_GPIO.GPIO_Pin = SPI1_GPIO_MISO_PIN | SPI1_GPIO_MOSI_PIN | SPI1_GPIO_SCLK_PIN;
        SPI_GPIO.GPIO_Mode = GPIO_Mode_AF;
        SPI_GPIO.GPIO_PuPd = GPIO_PuPd_NOPULL;
        SPI_GPIO.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_Init(SPI1_GPIO_PIN_GROUP, &SPI_GPIO);
        GPIO_PinAFConfig(SPI1_GPIO_PIN_GROUP, SPI1_GPIO_MISO_SOURCE, SPI1_GPIO_PIN_AF);
        GPIO_PinAFConfig(SPI1_GPIO_PIN_GROUP, SPI1_GPIO_MOSI_SOURCE, SPI1_GPIO_PIN_AF);
        GPIO_PinAFConfig(SPI1_GPIO_PIN_GROUP, SPI1_GPIO_SCLK_SOURCE, SPI1_GPIO_PIN_AF);

        /* SPI1 Rx DMA */
        if(RT_NULL != SPI1_DMA_RX) {
            RCC_AHBPeriphClockCmd(SPI1_DMA_RCC, ENABLE);
            spi_bus->rx_dma = SPI1_DMA_RX;
            spi_bus->RxDMAISR = STM32_spi1_bus_rx_dma_isr;
            spi_bus->RxISR = RT_NULL;
        }
        else {
            spi_bus->rx_dma = RT_NULL;
            spi_bus->RxDMAISR = RT_NULL;
            spi_bus->RxISR = STM32_spi1_bus_rx_isr;
        }

        /* SPI1 Tx DMA */
        if(RT_NULL != SPI1_DMA_TX) {
            RCC_AHBPeriphClockCmd(SPI1_DMA_RCC, ENABLE);
            spi_bus->tx_dma = SPI1_DMA_TX;
            spi_bus->TxDMAISR = STM32_spi1_bus_tx_dma_isr;
            spi_bus->TxISR = RT_NULL;
        }
        else {
            spi_bus->tx_dma = RT_NULL;
            spi_bus->TxDMAISR = RT_NULL;
            spi_bus->TxISR = STM32_spi1_bus_tx_isr;
        }
    }
    else if(spi_bus->spix == SPI2) {
        /* SPI2 RCC */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE);

        /* SPI2 GPIO */
        RCC_AHBPeriphClockCmd(SPI2_GPIO_PIN_RCC, ENABLE);
        GPIO_StructInit(&SPI_GPIO);
        SPI_GPIO.GPIO_Pin = SPI2_GPIO_MISO_PIN | SPI2_GPIO_MOSI_PIN | SPI2_GPIO_SCLK_PIN;
        SPI_GPIO.GPIO_Mode = GPIO_Mode_AF;
        SPI_GPIO.GPIO_PuPd = GPIO_PuPd_NOPULL;
        SPI_GPIO.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_Init(SPI2_GPIO_PIN_GROUP, &SPI_GPIO);
        GPIO_PinAFConfig(SPI2_GPIO_PIN_GROUP, SPI2_GPIO_MISO_SOURCE, SPI2_GPIO_PIN_AF);
        GPIO_PinAFConfig(SPI2_GPIO_PIN_GROUP, SPI2_GPIO_MOSI_SOURCE, SPI2_GPIO_PIN_AF);
        GPIO_PinAFConfig(SPI2_GPIO_PIN_GROUP, SPI2_GPIO_SCLK_SOURCE, SPI2_GPIO_PIN_AF);

