SchumyHao/heat_meter_rtt/drivers/rt_stm32f0xx_spi.c
        /* SPI2 Rx DMA */
        if(RT_NULL != SPI2_DMA_RX) {
            RCC_AHBPeriphClockCmd(SPI1_DMA_RCC, ENABLE);
            spi_bus->rx_dma = SPI2_DMA_RX;
            spi_bus->RxDMAISR = STM32_spi2_bus_rx_dma_isr;
            spi_bus->RxISR = RT_NULL;
        }
        else {
            spi_bus->rx_dma = RT_NULL;
            spi_bus->RxDMAISR = RT_NULL;
            spi_bus->RxISR = STM32_spi2_bus_rx_isr;
        }

        /* SPI2 Tx DMA */
        if(RT_NULL != SPI2_DMA_TX) {
            RCC_AHBPeriphClockCmd(SPI1_DMA_RCC, ENABLE);
            spi_bus->tx_dma = SPI2_DMA_TX;
            spi_bus->TxDMAISR = STM32_spi2_bus_tx_dma_isr;
            spi_bus->TxISR = RT_NULL;
        }
        else {
            spi_bus->tx_dma = RT_NULL;
            spi_bus->TxDMAISR = RT_NULL;
            spi_bus->TxISR = STM32_spi2_bus_tx_isr;
        }
    }
    else {
        return -RT_ENOSYS;
    }

    return RT_EOK;
}

rt_err_t rt_hw_spi_bus_init(void)
{
    rt_err_t ret = RT_EOK;

#ifdef RT_USING_SPI1
    stm32_spi_bus_1.spix = SPI1;
    ret = stm32_spi_bus_device_init(stm32_spi_bus_1, "spi1");
    if(RT_EOK != ret) {
        return ret;
    }
    stm32_spi_bus_1.parent.parent.flag |= RT_DEVICE_FLAG_ACTIVATED;
#endif /* RT_USING_SPI1 */

#ifdef RT_USING_SPI2
    stm32_spi_bus_2.spix = SPI2;
    ret = stm32_spi_bus_device_init(stm32_spi_bus_2, "spi2");
    if(RT_EOK != ret) {
        return ret;
    }
    stm32_spi_bus_2.parent.parent.flag |= RT_DEVICE_FLAG_ACTIVATED;
#endif /* RT_USING_SPI2 */

    return RT_EOK;
}

